snlkuharlocal/src/Documents/Паллета/Паллета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Паллета</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Паллета</basedOn>
  <registerRecords>AccumulationRegister.АдресноеХранениеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиРасходныхМатериалов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистЗагрузки</name>
    <type>
      <types>DocumentRef.ЛистЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>СборнаяПаллета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSCCКод</name>
    <comment>упаковочный для клиента Лента</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеальноеПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Паллетировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НеГабарит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеКоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииСгенерирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Расформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛистыНабора</name>
    <attributes>
      <name>ЛистНабора</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЛистаНабора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыТоваров</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробокВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SSCCКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>21</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковкиКороба</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыРНКПНКПРМ/РеквизитыРНКПНКПРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыРНКПНКПРМ</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Паллета/ManagerModule.bsl
//Данилова Е.В. 05.02.2026 OUT-191
// Кельманов А.В. - HELP-2579 - 2025.01.16
Процедура ЗаполнитьНоменклатуру(Паллета,Накладная = неопределено) Экспорт
	//++Данилова Е.В. 05.02.2026 OUT-19 
	Если Накладная <> Неопределено Тогда
		СтрокиНакладной = Паллета.Товары.НайтиСтроки(Новый Структура("Накладная",Накладная));
		Для каждого СтрокаНакладной Из СтрокиНакладной Цикл
		
			Паллета.Товары.Удалить(СтрокаНакладной); 	
		
		КонецЦикла;
		//как заглушка, чтобы избежать сейчас пустых строк по накладной 
		СтрокиНакладной = Паллета.Товары.НайтиСтроки(Новый Структура("Накладная",Неопределено));
		Для каждого СтрокаНакладной Из СтрокиНакладной Цикл
		
			Паллета.Товары.Удалить(СтрокаНакладной); 	
		
		КонецЦикла;
	Иначе
		Паллета.Товары.Очистить();
	КонецЕсли;
	//--Данилова Е.В. 05.02.2026
	СписокЛН = Паллета.ЛистыНабора.Выгрузить(); 
	//++Данилова Е.В. 04.02.2026 OUT-191
	//СписокЛН.Свернуть("ЛистНабора");
	СписокЛН.Свернуть("ЛистНабора,Документ");
	//--Данилова Е.В. 04.02.2026
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Количество");
	//++Данилова Е.В. 04.02.2026 OUT-191
	ТЗ.Колонки.Добавить("Накладная");
	//--Данилова Е.В. 04.02.2026
	
	Для Каждого СтрокаТЗ Из СписокЛН Цикл
		
		ЛН = СтрокаТЗ.ЛистНабора;
		
		Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда			
			
			МассСтрок = Паллета.ЛистыНабора.НайтиСтроки(Новый Структура("ЛистНабора", ЛН));
			СписокКоробок = ПолучитьСписокШКкоробокЛистаНабораПаллетная(ЛН); 		
			Для Каждого СтрМассСтрок Из МассСтрок Цикл
				
				СтрокаКоробки = СписокКоробок.Найти(СтрМассСтрок.ШКЛистаНабора);
				
				Если СтрокаКоробки <> Неопределено Тогда
					
					СтрТЗ = ТЗ.Добавить();
					
					СтрТЗ.Номенклатура = СтрокаКоробки.номенклатура;
					СтрТЗ.количество = СтрокаКоробки.КоличествоВКоробе;
					//++Данилова Е.В. 04.02.2026 OUT-191
					СтрТЗ.Накладная = СтрокаТЗ.Документ; 
					//--Данилова Е.В. 04.02.2026
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрТЧТоварыЛН Из ЛН.Товары Цикл
				
				СтрТЗ = ТЗ.Добавить();
				
				СтрТЗ.Номенклатура = СтрТЧТоварыЛН.Номенклатура;
				СтрТЗ.Количество = СтрТЧТоварыЛН.Количество;
				//++Данилова Е.В. 04.02.2026 OUT-191
				СтрТЗ.Накладная = СтрокаТЗ.Документ; 
				//--Данилова Е.В. 04.02.2026

				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	//++Данилова Е.В. 04.02.2026 OUT-191
	//ТЗ.Свернуть("Номенклатура","Количество");
	ТЗ.Свернуть("Номенклатура,Накладная","Количество");
	//++Данилова Е.В. 24.03.2026 ASU-2089
	ТЗ.Колонки.Добавить("Продукция",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Если ЗначениеЗаполнено(Накладная) Тогда 
		ЗаполнитьПродукцииВТаблицеТоваровПоНакладной(ТЗ,Накладная);
	Иначе
		ТЗНаклКопия = ТЗ.Скопировать(,"Накладная"); 
		ТЗНаклКопия.Свернуть("Накладная");
		МассивНакладных = ТЗНаклКопия.ВыгрузитьКолонку("Накладная"); 
		Для каждого НакладнаяИз Из МассивНакладных Цикл
		
			ЗаполнитьПродукцииВТаблицеТоваровПоНакладной(ТЗ,НакладнаяИз);	
		
		КонецЦикла;
		
	КонецЕсли;
	//--Данилова Е.В. 24.03.2026 
	Если Накладная <> Неопределено Тогда 
		СтрокиНакладной = ТЗ.НайтиСтроки(новый Структура("Накладная",Накладная)); 
		Для каждого СтрокаНакладной Из СтрокиНакладной Цикл
			
			НоваяСтрока = Паллета.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНакладной); 	
			
		КонецЦикла;
		
	Иначе 	
		Паллета.Товары.Загрузить(ТЗ);
	КонецЕсли;
	//--Данилова Е.В. 04.02.2026
КонецПроцедуры

// Кельманов А.В. - HELP-2579 - 2025.01.16
Функция ПолучитьСписокШКкоробокЛистаНабораПаллетная(ЛН) Экспорт 
	//++Данилова Е.В. 23.04.2026  MARK-3539
	Если ТипЗнч(ЛН)=Тип("ДокументСсылка.ЛистНабора") Тогда
		ТипДокумента="ЛистНабора";
	иначе
		ТипДокумента="ЛистПереукладки";
	КонецЕсли;
	//--Данилова Е.В. 23.04.2026 	
	ТЗ = Новый таблицазначений;
	
	ТЗ.Колонки.Добавить("НомерКоробкиЛН");	
	ТЗ.Колонки.Добавить("НомерКоробки");
	ТЗ.Колонки.Добавить("ШК");		
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("КоличествоВКоробе");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.Дата < &Дата
	|	И ЛистНабора.ДокОснование = &ДокОснование
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДокОснование", ЛН.ДокОснование);
	Запрос.УстановитьПараметр("Дата", ЛН.Дата);
	//++Данилова Е.В. 23.04.2026 MARK-3539
	Запрос.Текст=СтрЗаменить(запрос.Текст,"ЛистНабора",ТипДокумента);
	//НомерНачКоробки = 1;
	//--Данилова Е.В. 23.04.2026
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если РезультатЗапроса.КоличествоКоробок = Null Тогда 
			
			Продолжить;
			
		КонецЕсли;
		//++Данилова Е.В. 23.04.2026 MARK-3539
		//НомерНачКоробки = НомерНачКоробки + РезультатЗапроса.КоличествоКоробок;
		//--Данилова Е.В. 23.04.2026
	КонецЦикла;
    //++Данилова Е.В. 23.04.2026 MARK-3539
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ЛистНабора.Номер,
	//|	ЛистНабора.КоличествоКоробок
	//|ИЗ
	//|	Документ.ЛистНабора КАК ЛистНабора
	//|ГДЕ
	//|	ЛистНабора.Проведен
	//|	И ЛистНабора.Дата = &Дата
	//|	И ЛистНабора.ДокОснование = &ДокОснование
	//|	И ЛистНабора.Ссылка <> &Ссылка
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Запрос.УстановитьПараметр("ДокОснование",ЛН.ДокОснование);
	//Запрос.УстановитьПараметр("Дата", ЛН.Дата);
	//Запрос.УстановитьПараметр("Ссылка", ЛН.Ссылка);
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//Пока Рез.Следующий() Цикл
	//	
	//	Если Число(Прав(Рез.Номер, 5)) < Число(Прав(ЛН.Номер, 5)) Тогда
	//		
	//		НомерНачКоробки = НомерНачКоробки + Рез.КоличествоКоробок;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
    //--Данилова Е.В. 23.04.2026
	Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда
		
		ТабНоменклатурыПоКоробам = Новый ТаблицаЗначений;
		
		ТабНоменклатурыПоКоробам.Колонки.Добавить("Номенклатура");
		ТабНоменклатурыПоКоробам.Колонки.Добавить("КоличествоВКоробе");
		
		Для Каждого СтрокаТЧ Из ЛН.Товары Цикл
			
			КоличествоКоробов = ?(СтрокаТЧ.ШтВКоробе = 0, СтрокаТЧ.Количество, СтрокаТЧ.Количество / СтрокаТЧ.ШтВКоробе);
			
			// Кухарь А.Ю.  24.05.2026 начало
			// HELP-9898
			если КоличествоКоробов < 1 и КоличествоКоробов > 0 тогда  
				СтрокаТЧ.ШтВКоробе =  СтрокаТЧ.Количество;
				КоличествоКоробов  = 1;
			КонецЕсли;
			// Кухарь А.Ю.  24.05.2026 конец
			
			Для СчКоробов = 1 По КоличествоКоробов Цикл
				
				СтрТабНом = ТабНоменклатурыПоКоробам.Добавить();
				
				СтрТабНом.Номенклатура = СтрокаТЧ.Номенклатура;
				СтрТабНом.КоличествоВКоробе = ?(СтрокаТЧ.ШтВКоробе = 0, 1, СтрокаТЧ.ШтВКоробе);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

	Для Сч = 1 По ЛН.КоличествоКоробок Цикл 
		
		СтрТЗ = ТЗ.Добавить();
		
		СтрТЗ.НомерКоробкиЛН = Сч;
		//++Данилова Е.В. 23.04.2026 MARK-3539
		НомерКоробки = 0; 
		Если ТипДокумента = "ЛистНабора" тогда 
			ТекШК = ЛН.ШКЛистаНабора + формат(Сч, "ЧЦ=5; ЧВН=");
			СтрокаНумерации = ЛН.НомераКоробок.Получить(Сч-1); 
			Если СтрокаНумерации <> неопределено Тогда
				
				НомерКоробки = СтрокаНумерации.НомерКоробки; 	
				
			КонецЕсли;
		Иначе
			//для отсканированной коробки в лп кодируется лист и номер коробки
			НомерКоробки = ЛН.НомерКоробки;
			ТекШК = ЗакодироватьЛистИКоробкуВСтроку(ЛН,НомерКоробки); 		 
		КонецЕсли;
		
		//--Данилова Е.В. 23.04.2026
		//++Данилова Е.В. 23.04.2026 MARK-3539 
		Если ТипДокумента = "ЛистНабора" тогда 
			// Кухарь А.Ю.  11.02.2026 начало   
			//ТекШК = ТекШК + КонтрольныйСимволEAN(ТекШК, 13); 
			// HELP-8843
			если СтрДлина(ТекШК) > 5 тогда 
				ТекШК = ТекШК + КонтрольныйСимволEAN(ТекШК, 13);        
			иначе 
				//++Данилова Е.В. 23.04.2026 MARK-3539
				//ТекШК = ЗакодироватьЛистИКоробкуВСтроку(ЛН,НомерНачКоробки + Сч - 1);
				ТекШК = ЗакодироватьЛистИКоробкуВСтроку(ЛН,НомерКоробки);
				//--Данилова Е.В. 23.04.2026 
			КонецЕсли; 
			// Кухарь А.Ю.  11.02.2026 конец
		КонецЕсли;
		//--Данилова Е.В. 23.04.2026 
		
		СтрТЗ.ШК = ТекШК;
		//++Данилова Е.В. 23.04.2026 MARK-3539
		//СтрТЗ.НомерКоробки = НомерНачКоробки + Сч - 1;
		СтрТЗ.НомерКоробки = НомерКоробки;
		//--Данилова Е.В. 23.04.2026
		Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда
			
			СтрТЗ.Номенклатура = ТабНоменклатурыПоКоробам.Получить(Сч - 1).Номенклатура;
			СтрТЗ.КоличествоВКоробе = ТабНоменклатурыПоКоробам.Получить(Сч - 1).КоличествоВКоробе;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТЗ;	

КонецФункции 

// Кухарь А.Ю. 26.01.2025 начало
//
Процедура РаспечататьАгрегационныйКодПаллет (Накладная) экспорт
КонецПроцедуры
// Кухарь А.Ю. 26.01.2025 конец


// Кухарь А.Ю. 26.01.2025 начало
//
Процедура ЗаполнитьАгрегационныйКодПаллеты (Паллета) экспорт
КонецПроцедуры
// Кухарь А.Ю. 26.01.2025 конец

 //++Данилова Е.В. 04.02.2026 OUT-191
 Функция ФормироватьНаборКодовАгрегацииНаПаллету(Знач Накладная, Знач ПравилаРаботыСАгрегациейЧЗ)  Экспорт 
 
 	Если ПравилаРаботыСАгрегациейЧЗ = Неопределено Тогда
	
		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);	
	
	КонецЕсли;
	
	ПроверятьУникальностьАртикулаФизич = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Накладная.Получатель,"ОдинАртикулНаПаллетуФизически",ложь);
	
	Если ПравилаРаботыСАгрегациейЧЗ.ФормироватьНаборКодовАгрегацииНаПаллету
		И НЕ ПроверятьУникальностьАртикулаФизич Тогда
		
		Возврат истина; 
		
	КонецЕсли;
	
	Возврат ложь; 
 
 КонецФункции // ()
 
 //--Данилова Е.В. 04.02.2026  
 
 //++Данилова Е.В. 05.02.2026   OUT-19 
 Функция ПолучитьТЗТоварыПоПаллете(Паллета) Экспорт
	 
	СписокЛН = Паллета.ЛистыНабора.Выгрузить(); 	
	СписокЛН.Свернуть("ЛистНабора,Документ");	
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Количество");	
	ТЗ.Колонки.Добавить("Накладная");
	
	
	Для Каждого СтрокаТЗ Из СписокЛН Цикл
		
		ЛН = СтрокаТЗ.ЛистНабора;
		
		Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда			
			
			МассСтрок = Паллета.ЛистыНабора.НайтиСтроки(Новый Структура("ЛистНабора", ЛН));
			
			СписокКоробок = ПолучитьСписокШКкоробокЛистаНабораПаллетная(ЛН);
			
			Для Каждого СтрМассСтрок Из МассСтрок Цикл
				
				СтрокаКоробки = СписокКоробок.Найти(СтрМассСтрок.ШКЛистаНабора);
				
				Если СтрокаКоробки <> Неопределено Тогда
					
					СтрТЗ = ТЗ.Добавить();
					
					СтрТЗ.Номенклатура = СтрокаКоробки.номенклатура;
					СтрТЗ.количество = СтрокаКоробки.КоличествоВКоробе;
					СтрТЗ.Накладная = СтрокаТЗ.Документ;  								
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрТЧТоварыЛН Из ЛН.Товары Цикл
				
				СтрТЗ = ТЗ.Добавить();
				
				СтрТЗ.Номенклатура = СтрТЧТоварыЛН.Номенклатура;
				СтрТЗ.Количество = СтрТЧТоварыЛН.Количество;
				СтрТЗ.Накладная = СтрокаТЗ.Документ; 		

				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура,Накладная","Количество");
	
	Возврат ТЗ; 
	
КонецФункции
 //--Данилова Е.В. 05.02.2026 
 
 //++Данилова Е.В. 05.03.2026 SNL-157 
 Функция РаспределитьSSCCКодыПоНакладной(Знач Накладная) Экспорт
	 
	 РезультатРаспределения = МаркировкаКС.СтруктураРезультата(Истина); 
	 	 
	 КолвоКодов = 0;
	 //проверим СИСИ кода
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &текдок
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита ПОДОБНО &рек";
	
	Запрос.УстановитьПараметр("ТекДок", Накладная);
	Запрос.УстановитьПараметр("рек", "СерийныйНомерУпаковки%");
	
	РезКоды = Запрос.Выполнить().Выгрузить();
	
	КолКодов = РезКоды.Количество();
	
	Если КолКодов = 0 Тогда
		Возврат РезультатРаспределения;
	КонецЕсли; 
	
	// Ихсанов Д. А. Начало 28.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7656
	// Получение данных по наличию экспозиторв по накладной
	МенеджерЗаписи = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Накладная;
	МенеджерЗаписи.ИмяРеквизита = "Экспозитор";
	МенеджерЗаписи.Прочитать();
	
	лЭкспозитор = Неопределено;
	Если МенеджерЗаписи.Выбран()
		И ТипЗнч(МенеджерЗаписи.ЗначениеРеквизита) = Тип("СправочникСсылка.Номенклатура") Тогда
		лЭкспозитор = МенеджерЗаписи.ЗначениеРеквизита;
	КонецЕсли;
	// Ихсанов Д. А. Конец  28.10.2025
	
	// для клиента Лента, делаем распределение по листам Палетта. На складе.
	
	// Кухарь А.Ю.  10.04.2024 начало
	//	Если  КолКодов>1 и контрагент.Код = "SSR-1593"  и планыобмена.Основной.ЭтотУзел().ТипУзла = перечисления.ТипУзлаИБ.Склад  тогда  
	//++Данилова Е.В. 04.02.2026 
	Если ФормироватьНаборКодовАгрегацииНаПаллету(Накладная,Неопределено) Тогда 
		РезультатРаспределения = РаспределитьSSCCВРазрезеАртикуловВПаллете(РезКоды,Накладная);
	Иначе
		РезультатРаспределения = РаспределитьSSCCПоПаллетам(РезКоды,Накладная); 
	КонецЕсли;	
	//--Данилова Е.В. 04.02.2026  
	
	Возврат РезультатРаспределения; 
КонецФункции

Функция РаспределитьSSCCВРазрезеАртикуловВПаллете(РезКоды,Знач Накладная)  
	
	РезультатРаспределения = МаркировкаКС.СтруктураРезультата(ложь); 
	
	КолКодов = РезКоды.Количество(); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПаллетаЛистыНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.ЛистНабора.ДокОснование = &ТекРНК
	|	И ПаллетаЛистыНабора.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ТекРНК", Накладная);
	
	РезПалетты = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекПалетта Из РезПалетты Цикл
		
		Док = ТекПалетта.Ссылка.ПолучитьОбъект();    
		
		//++Данилова Е.В. 05.02.2026 OUT-191 						
		Документы.Паллета.ЗаполнитьНоменклатуру(Док,Накладная); 
		//--Данилова Е.В. 05.02.2026 
		Попытка
			// Кухарь А.Ю.  16.03.2026 начало
			если не Док.ДополнительныеСвойства.Свойство("НеКонтролироватьНаличиеКодовАгрегации") тогда
				Док.ДополнительныеСвойства.Вставить("НеКонтролироватьНаличиеКодовАгрегации",Истина)           
			КонецЕсли; 
			док.ДополнительныеСвойства.НеКонтролироватьНаличиеКодовАгрегации = Истина;  	 
			// Кухарь А.Ю.  16.03.2026 конец
			Док.Записать();	
			
		Исключение
			РезультатРаспределения.Ошибки.Добавить("Не удалось заполнить номенклатуру по  документу " + Строка(Док.ссылка) + " " +  ОписаниеОшибки());
		КонецПопытки;
		
		
	КонецЦикла;
	
	Если РезультатРаспределения.Ошибки.Количество() > 0 Тогда
	
		Возврат РезультатРаспределения; 	
	
	КонецЕсли;
	
	СтруктураДанных = Новый Структура("Номенклатура, ПунктДоставки, Договор, Дата, Контрагент, ПостояннаяАкция");
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Накладная);
	
	ЗапросНоменклатура = Новый Запрос;
	
	ЗапросНоменклатура.Текст =
	"ВЫБРАТЬ
	|	ТЗ_Паллеты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Паллеты
	|ИЗ
	|	&ТЗ_Паллеты КАК ТЗ_Паллеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//++Данилова Е.В. 24.03.2026 ASU-2089  
	//|	ПаллетаТовары.Номенклатура КАК Номенклатура
	|	ПаллетаТовары.Продукция КАК Номенклатура
	//--Данилова Е.В. 24.03.2026 
	|ИЗ
	|	ВТ_Паллеты КАК ВТ_Паллеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета.Товары КАК ПаллетаТовары
	|		ПО ВТ_Паллеты.Ссылка = ПаллетаТовары.Ссылка 
	//++Данилова Е.В. 04.02.2026 OUT-191
	|ГДЕ
	|	ПаллетаТовары.Накладная = &Накладная";
	ЗапросНоменклатура.УстановитьПараметр("Накладная", Накладная);
	//--Данилова Е.В. 04.02.2026 
	
	ЗапросНоменклатура.УстановитьПараметр("ТЗ_Паллеты", РезПалетты);
	
	ТЗ_Номенклатура = ЗапросНоменклатура.Выполнить().Выгрузить();
	
	МассивНоменклатуры = ТЗ_Номенклатура.ВыгрузитьКолонку("Номенклатура");
	
	СтруктураДанных.Номенклатура = МассивНоменклатуры;
	
	ТЗ_Матриц = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанных);
	
	ЗапросАртикулыКонтрагента = Новый Запрос;
	
	ЗапросАртикулыКонтрагента.Текст = "ВЫБРАТЬ
	|	ТЗ_Паллеты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Паллеты
	|ИЗ
	|	&ТЗ_Паллеты КАК ТЗ_Паллеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_Матриц.Номенклатура КАК Номенклатура,
	|	ТЗ_Матриц.АртикулКонтрагента КАК АртикулКонтрагента
	|ПОМЕСТИТЬ ВТ_Матриц
	|ИЗ
	|	&ТЗ_Матриц КАК ТЗ_Матриц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаллетаТовары.Ссылка КАК Паллета,
	//++Данилова Е.В. 24.03.2026 ASU-2089
	//|	ПаллетаТовары.Номенклатура КАК Номенклатура,
	|	ПаллетаТовары.Продукция КАК Номенклатура,
	//--Данилова Е.В. 24.03.2026 
	|	ВТ_Матриц.АртикулКонтрагента КАК АртикулКонтрагента
	|ИЗ
	|	ВТ_Паллеты КАК ВТ_Паллеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета.Товары КАК ПаллетаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Матриц КАК ВТ_Матриц
	//++Данилова Е.В. 24.03.2026 ASU-2089 
	//|			ПО ПаллетаТовары.Номенклатура = ВТ_Матриц.Номенклатура
	|			ПО ПаллетаТовары.Продукция = ВТ_Матриц.Номенклатура
	//--Данилова Е.В. 24.03.2026 
	|		ПО ВТ_Паллеты.Ссылка = ПаллетаТовары.Ссылка
	//++Данилова Е.В. 04.02.2026 OUT-191
	|		И ПаллетаТовары.Накладная = &Накладная 
	//--Данилова Е.В. 04.02.2026 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Паллета,
	|	ПаллетаТовары.НомерСтроки";
	
	ЗапросАртикулыКонтрагента.УстановитьПараметр("ТЗ_Паллеты", РезПалетты);		
	ЗапросАртикулыКонтрагента.УстановитьПараметр("ТЗ_Матриц", ТЗ_Матриц);
	//++Данилова Е.В. 04.02.2026 OUT-191
	ЗапросАртикулыКонтрагента.УстановитьПараметр("Накладная", Накладная);
	//--Данилова Е.В. 04.02.2026
	
	ТЗ_ПаллетыНоменклатураАртикулы = ЗапросАртикулыКонтрагента.Выполнить().Выгрузить();
	ТЗ_ПаллетыАртикулы = ТЗ_ПаллетыНоменклатураАртикулы.Скопировать();
	ТЗ_ПаллетыАртикулы.Свернуть("Паллета, АртикулКонтрагента");
	ТЗ_ПаллетыАртикулы.Колонки.Добавить("SSCCКод", Новый ОписаниеТипов("Строка"));
	
	ПаллетыАртикулыКоличество = ТЗ_ПаллетыАртикулы.Количество();
	
	Если ПаллетыАртикулыКоличество <> КолКодов Тогда
		
		//Предупреждение("Кол-во SSCC кодов документа: " + КолКодов + "; Требуется SSCC кодов: " + ПаллетыАртикулыКоличество);
		РезультатРаспределения.Ошибки.Добавить("Кол-во SSCC кодов документа: " + КолКодов + "; Требуется SSCC кодов: " + ПаллетыАртикулыКоличество); 
		Возврат РезультатРаспределения;
		
	Иначе
		
		Счетчик = 0;
		
		Для Каждого Стр Из ТЗ_ПаллетыАртикулы Цикл
			
			Стр.SSCCкод = РезКоды[Счетчик].ЗначениеРеквизита;
			
			Счетчик = Счетчик + 1;
			
		Конеццикла;
		
		Для Каждого ТекПалетта Из РезПалетты Цикл
			
			Док = ТекПалетта.Ссылка.ПолучитьОбъект();
			
			//++Данилова Е.В. 04.02.2026 OUT-191  
			СтрокиТоваровРНК = Док.Товары.НайтиСтроки(новый Структура("Накладная",Накладная)); 
			//Для Каждого СтрТовары Из Док.Товары Цикл
			Для Каждого СтрТовары Из СтрокиТоваровРНК Цикл
				//--Данилова Е.В. 04.02.2026
				//++Данилова Е.В. 24.03.2026 ASU-2089
				//ПаллетаНоменклатура = Новый Структура("Паллета, Номенклатура", ТекПалетта.Ссылка, СтрТовары.Номенклатура);
				ПаллетаНоменклатура = Новый Структура("Паллета, Номенклатура", ТекПалетта.Ссылка, СтрТовары.Продукция);
				//--Данилова Е.В. 24.03.2026 
				СтрокиАртикул = ТЗ_ПаллетыНоменклатураАртикулы.НайтиСтроки(ПаллетаНоменклатура);
				
				АртикулКонтрагента = СтрокиАртикул[0].АртикулКонтрагента;
				
				ПаллетаАртикул = Новый Структура("Паллета, АртикулКонтрагента", ТекПалетта.Ссылка, АртикулКонтрагента);
				
				СтрокиSSCCКод = ТЗ_ПаллетыАртикулы.НайтиСтроки(ПаллетаАртикул);
				
				СтрТовары.SSCCКод = СтрокиSSCCКод[0].SSCCКод;
				
			Конеццикла;
			
			Попытка
				// Кухарь А.Ю.  16.03.2026 начало
				если не Док.ДополнительныеСвойства.Свойство("НеКонтролироватьНаличиеКодовАгрегации") тогда
					Док.ДополнительныеСвойства.Вставить("НеКонтролироватьНаличиеКодовАгрегации",Истина)           
				КонецЕсли; 
				док.ДополнительныеСвойства.НеКонтролироватьНаличиеКодовАгрегации = Истина;  	 
				// Кухарь А.Ю.  16.03.2026 конец
				
				Док.Записать();	
				
			Исключение
				РезультатРаспределения.Ошибки.Добавить("Не удалось записать документ: " + Строка(Док.ссылка) + " " +  ОписаниеОшибки()); 
			КонецПопытки;
			
			
		КонецЦикла;
		
	КонецЕсли; 
	
	РезультатРаспределения.Успешно = РезультатРаспределения.Ошибки.Количество() = 0; 
	Возврат РезультатРаспределения; 
	
КонецФункции

Функция РаспределитьSSCCПоПаллетам(РезКоды,Знач Накладная)
	
	РезультатРаспределения = МаркировкаКС.СтруктураРезультата(ложь); 
	
	КолКодов = РезКоды.Количество(); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПаллетаЛистыНабора.Ссылка
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.ЛистНабора.ДокОснование = &ТекРНК
	//нечаева 27,12,16+++
	|	И ПаллетаЛистыНабора.Ссылка.Проведен = истина";
	//нечаева 27,12,16---
	
	Запрос.УстановитьПараметр("ТекРНК", Накладная);
	
	РезПалетты = Запрос.Выполнить().Выгрузить();
	
	КолПаллет = РезПалетты.Количество();
	
	Если колПаллет <> КолКодов Тогда
		
		//Предупреждение("Не совпадает кол-во паллет и SSCC кодов документа!");
		РезультатРаспределения.Ошибки.Добавить("Не совпадает кол-во паллет и SSCC кодов документа!"); 
		Возврат РезультатРаспределения;  		
		
	Иначе
		
		рр = 0;
		
		Для Каждого ТекПалетта Из РезПалетты Цикл
			
			Док = ТекПалетта.Ссылка.ПолучитьОбъект();
			
			//++Данилова Е.В. 09.02.2026 OUT-191 						
			Документы.Паллета.ЗаполнитьНоменклатуру(Док,Накладная);
			
			Для каждого СтрокаТоваров  Из Док.Товары Цикл
			
				СтрокаТоваров.SSCCКод = РезКоды[рр].ЗначениеРеквизита; 	
			
			КонецЦикла;
			//--Данилова Е.В. 09.02.2026
			
			Док.SSCCкод = РезКоды[рр].ЗначениеРеквизита;  
			Попытка
				// Кухарь А.Ю.  16.03.2026 начало
				если не Док.ДополнительныеСвойства.Свойство("НеКонтролироватьНаличиеКодовАгрегации") тогда
					Док.ДополнительныеСвойства.Вставить("НеКонтролироватьНаличиеКодовАгрегации",Истина)           
				КонецЕсли; 
				док.ДополнительныеСвойства.НеКонтролироватьНаличиеКодовАгрегации = Истина;  	 
				// Кухарь А.Ю.  16.03.2026 конец
				
				Док.Записать();	
				
			Исключение
				РезультатРаспределения.Ошибки.Добавить("Не удалось записать документ: " + Строка(Док.ссылка) + " " +  ОписаниеОшибки());
			КонецПопытки;
			
			
			рр = рр + 1;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	РезультатРаспределения.Успешно = РезультатРаспределения.Ошибки.Количество() = 0; 
	Возврат РезультатРаспределения;

КонецФункции

 //--Данилова Е.В. 05.03.2026
//++Данилова Е.В. 24.03.2026 ASU-2089  
 Процедура ЗаполнитьПродукцииВТаблицеТоваровПоНакладной(ТЗТовары,Знач Накладная) экспорт
     ТЗТоварыКопия = ТЗТовары.Скопировать(); 
	 
	 СтрокиНакладной = ТЗТовары.НайтиСтроки(Новый Структура("Накладная",Накладная));
	 Для каждого СтрокаНакладной Из СтрокиНакладной Цикл
		 
		 ТЗТовары.Удалить(СтрокаНакладной); 	
		 
	 КонецЦикла; 
	 
	 Запрос = Новый Запрос;
	 Если Накладная.ОтгрузкаКомплектов Тогда 		 
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		 |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
		 |	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		 |ИЗ
		 |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		 |ГДЕ
		 |	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	РасходнаяНакладнаяКомплектующие.Продукция,
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура";
		 
		 Запрос.УстановитьПараметр("Ссылка", Накладная); 	  	 	 
		 
	 Иначе 
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Продукция,
		 |	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		 |ИЗ
		 |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяКомплектующие
		 |ГДЕ
		 |	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура,
		 |	РасходнаяНакладнаяКомплектующие.Номенклатура";
		 
		 Запрос.УстановитьПараметр("Ссылка", Накладная); 		 
		 
	 КонецЕсли;
	 
	 ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	 ТаблицаТоваров.Колонки.Добавить("ЕстьВЛН",Новый ОписаниеТипов("Булево"));
	  
	  
	 Для каждого СтрокаТоваров  Из ТЗТоварыКопия Цикл
		 Если СтрокаТоваров.Накладная <> Накладная  Тогда
			 
			 Продолжить; 	
			 
		 КонецЕсли;
		 КоличествоТовараВПаллете = СтрокаТоваров.Количество;
		 Отбор = Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура);
		 СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(Отбор);
		 
		 Для каждого СтрокаНайденные Из СтрокиНайденные Цикл 
			 
			 Если КоличествоТовараВПаллете = 0 Тогда
				 
				 Прервать; 
				 
				 
			 КонецЕсли;
			 
			 Кол = Мин(КоличествоТовараВПаллете,СтрокаНайденные.Количество);
			
			 
			 НоваяСтрока = ТЗТовары.Добавить(); 
			 ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТоваров); 
			 НоваяСтрока.Количество = Кол; 
			 НоваяСтрока.Продукция = СтрокаНайденные.Продукция; 
			 
			 КоличествоТовараВПаллете = КоличествоТовараВПаллете - Кол; 
			 
		 КонецЦикла;
		 
	 КонецЦикла;

	 
 КонецПроцедуры
 //--Данилова Е.В. 24.03.2026 
 
 //Валетов + Фоновая запись паллет
 Процедура  ФоновоеПроведениеПаллет(ТабПаллет) Экспорт  
	 Накладная = ТабПаллет.Документ;
	 НовоеСостояние = ТабПаллет.НовоеСостояние;  
	 КолОшибокПРоведения = 0;
	 КолОшибокБлокировок = 0;
	 
	 //ПланНабора 
	 Запрос = Новый Запрос;
	 запрос.Текст = "ВЫБРАТЬ
	 |	ПланНабора.Ссылка КАК Ссылка
	 |ИЗ
	 |	Документ.ПланНабора КАК ПланНабора
	 |ГДЕ
	 |	ПланНабора.Проведен
	 |	И ПланНабора.ДокОснование = &РНК";
	 запрос.УстановитьПараметр("РНК",Накладная);
	 
	 результат=запрос.Выполнить().Выбрать();
	 пока результат.Следующий() цикл
		 
		 ПланНабора = результат.ссылка.ПолучитьОбъект();
		 Для Каждого СтрТБ Из ПланНабора.тБрэндов Цикл
			 Если Не ЗначениеЗаполнено(СтрТБ.НачалоПаллетирования) Тогда
				 СтрТБ.НачалоПаллетирования=ТекущаяДата();
			 КонецЕсли;
			 СтрТБ.Состояние=НовоеСостояние;
		 КонецЦикла;
		 Попытка
			 ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);  
		 Исключение 
			 КолОшибокПРоведения = КолОшибокПРоведения + 1;
			 Если СтрНайти(ОписаниеОшибки(),"блокиров") > 0 Тогда
				 КолОшибокБлокировок = КолОшибокБлокировок + 1;
			 КонецЕсли;
		 КонецПопытки;
	 КонецЦикла;
	 
	 //ЗНБ 
	 Запрос=новый запрос;
	 запрос.Текст= "ВЫБРАТЬ
	 |	ЗаданиеНабора.Ссылка КАК Ссылка
	 |ИЗ
	 |	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	 |ГДЕ
	 |	ЗаданиеНабора.Накладная = &Накладная
	 |	И ЗаданиеНабора.Проведен
	 |	И ЗаданиеНабора.СостояниеНакладной <> &СостояниеНакладной";
	 запрос.УстановитьПараметр("Накладная",Накладная);
	 запрос.УстановитьПараметр("СостояниеНакладной",НовоеСостояние);
	 результат=запрос.Выполнить().Выбрать();
	 пока результат.Следующий() цикл
		 ЗНБ=результат.ссылка.получитьобъект();
		 ЗНБ.СостояниеНакладной=НовоеСостояние;
		 ЗНБ.ОбменДанными.Загрузка=Истина; 
		 Попытка
			 знб.Записать();
		 Исключение 
			 КолОшибокПРоведения = КолОшибокПРоведения + 1;
			 Если СтрНайти(ОписаниеОшибки(),"блокиров") > 0 Тогда
				 КолОшибокБлокировок = КолОшибокБлокировок + 1;
			 КонецЕсли;
		 КонецПопытки;
	 КонецЦикла;  
	 
	 ТЗНеизменяемыхРеквизитов=новый ТаблицаЗначений;
	 ТЗНеизменяемыхРеквизитов.Колонки.Добавить("ИмяРеквизита");
	 СтрТЗ=ТЗНеизменяемыхРеквизитов.Добавить();
	 СтрТЗ.ИмяРеквизита="КоличествоКоробок";
	 СтрТЗ=ТЗНеизменяемыхРеквизитов.Добавить();
	 СтрТЗ.ИмяРеквизита="Трудозатраты";
	 
	 ДокументОбъект = Накладная.ПОлучитьОбъект(); 
	 Попытка 
		 ДокументОбъект.ЗаписьБезКонтроляПолномочий(ТЗНеизменяемыхРеквизитов); 
	 Исключение 
		 КолОшибокПРоведения = КолОшибокПРоведения + 1;
		 Если СтрНайти(ОписаниеОшибки(),"блокиров") > 0 Тогда
			 КолОшибокБлокировок = КолОшибокБлокировок + 1;
		 КонецЕсли;
	 КонецПопытки;   
	 
	 
 КонецПроцедуры
 //--Данилова Е.В. 24.03.2026
